/*
कर्मण्येवाधिकारस्ते मा फलेषु कदाचन।
मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥
*/

/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

#include<algorithm>
#include<iostream>
#include<iterator>
#include<map>
#include<vector>
#include<set>
#include<unordered_map>
#include<unordered_set>
#include<numeric>
#include<queue>
#include<stack>
#include<climits>
#include<bits/stdc++.h>
#define f                       first
#define s                       second
#define ll                      long long
#define pb                      push_back
#define mp                      make_pair
#define pii                     pair<int,int>
#define vi                      vector<int>
#define mii                     unordered_map<int,int>
#define me(i,start,end)         for(int i =start; i<end; ++i)
#define she(i,start,end)        for(int i =end-1; i>=start; --i)
#define all(v)                  v.begin() , v.end()
#define w(x)                    int x;cin>>x;while(x--)

using namespace std;
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
bool isprime(int n);
void sieve();
void solve();
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
int main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL); 
    sieve();
    int t ;
    cin>>t;
    while(t--)
    {

        solve();
    }return 0;
}
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
bool isprime(int n)
{
    for(int i =2; i*i<n; ++i)
    {
        if(n%i ==0)return false;
    }
    return n>1;
}
const int N = 1e7+13;
vector<bool>prime(N,true);
void sieve()
{
    prime[0] = prime[1] = false;

    for(int i =2; i*i<=N; ++i)
    {
        if(isprime(i))
        {
            for(int j = i*i; j<=N; j += i)
            {
                prime[j] = false;
            }
        }
    }
}
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

vi factor(int n)
{
    vi fact;
    while(n%2 == 0)
    {
        fact.pb(2);
        n/=2;

    }

    for(int i =3 ; i*i<=n; i += 2)
    {
        while(n%i ==0 && prime[i])
        {
            fact.pb(i);
            n/=i;
        }
    }
    if(n>1)fact.pb(n);
    return fact;
}
void solve()
{
    //your code goes here

    // my approach , same as editoral just implemented no so cleanly
    // int n;
    // cin>>n;
    // int two =0,three=0;
    // while(n%2 ==0)
    // {

    //     n/=2;
    //     ++two;
    // }
    // while(n%3 == 0)
    // {
   
    //     n/=3;
    //     ++three;
    // }
    // if(n>1)cout<<-1<<endl;
    // else if(two == three)
    // {
    //     cout<<two<<endl;
    // }
    // else if( two < three)
    // {
    //     cout<<(three-two) + three<<endl; 
    // }
    // else if(two >three)
    // {
    //     cout<<-1<<endl;
    // }


//editorial
    // int n;cin>>n;
    // int d=0,t=0;
    // while(n%2 == 0)
    // {
    //     n/=2;++d;
    // }
    // while(n%3 == 0)
    // {
    //     n/=3;++t;
    // }
    // if(d <= t && n ==1)
    // {
    //     cout<<2*t - d<<endl;
    // }
    // else 
    // {
    //     cout<<"-1"<<endl;
    // }

// using factors

int n;cin>>n;
vi f = factor(n);
int d =0, t=0;
me(i,0,f.size())
{
    if(f[i] == 2)++d;
    if(f[i] == 3)++t;
}
if(f.size() == (t + d) && t >= d )
{
    cout<<2*t - d<<endl;
}
else{
    cout<<-1<<endl;
}
   
}

/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/


// © Copyright 2022 swastiksharma09_Template.ex